# RectangleLightShape Properties

---
The RectangleLightShape type exposes the following members.
| Name| Description
---|---|---
| EmitLength|  The emit length.
| EmitWidth|  The emit width.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from LightShape)
Top
#### Reference
RectangleLightShape Class
Autodesk.Revit.DB.Lighting Namespace